# BadFillingSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..BadFillingSpacing Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Spacing for Excess Length Fill is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadFillingSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadFillingSpacing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadFillingSpacing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace